app/controllers/posts_controller.rb

  def update
    @post = Post.find(params[:id])
    @post.update(params.require(:post))
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "posts" SET "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["description", "OOOOxxxxxxx"], ["updated_at", "2018-05-30 19:06:37.795147"], ["id", 17]]